x = 5     # დამატება და მინიჭება
x += 3

x = 10
x += 15

x = -2
x += 4

x = 0
x += 7

x = 3.5
x += 2.5

x = 100
x += -20

x = 1
x += 0

x = -10
x += 10

x = 2
x += x

x = 50
x += 1.5


#გამოკლება და მინიჭება

x = 10
x -= 5
 
x = 20
x -= 15

x = 7
x -= 7

x = 3.5
x -= 2.0

x = -5
x -= 10

x = 1
x -= 0

x = 100
x -= 50

x = 1
x -= 0

x = -3
x -= -7

x = 8
x -= 4.5


#გამრავლება და მინიჭება

X = 2
X *= 3

X = 5
X *= 5

X = 0
X *= 100

X = 1.5
X *= 2

X = -4
X *= 2

X = -3
X *= -3

X = 7
X *= 0

X = 6
X *= 1

X = 10
X *= 0.5

X = 3
X *= X


#გაყოფა და მინიჭება

X = 10
X /= 2

X = 5
X /= 5

X = 7.5
X /= 2.5

X = -8
X /= 2

X = 10
X /= -2

X = 1
X /= 0.5

X = 100
X /= 10

X = -20
X /= 4

X = 9
X /= 3

X = 2
X /= 2

#მეტია ან ტოლია ნიშნავს, რომ ერთი რიცხვი ან მნიშვნელობის ან უფრო დიდია, ან ტოლია მეორეს.

#ნაკლებია ან ტოლია ნიშნავს, რომ ერთი რიცხვი ან მნიშვნელობა ან  უფრო პატარაა,ან ტოლია


#ირობითი განცხადებები საშუალებას იძლევა პროგრამას შეხედოს გარკვეული პირობები და გადადგას სხვადასხვა ნაბიჯები იმაზე დამოკიდებულად, თუ რამდენად მართებულია ეს პირობები.

number = float(input("Enter a number"))

if number > 0
   print("The number is positive.")
elif number < 0
   print("The number is negative.") 
else:
   print("The number is zero.")