# 1) პითონის ფაილში ჩამოწერეთ 2 მიმატების, 2 გამოკლების, 2 გამრავლების და 2 გაყოფის მაგალითი
print(5 + 10)
print(15 + 15)
print(20 - 2)
print(15 - 3)
print(20 * 3)
print(4 * 5)
print(35 / 6)
print(10 / 5)

# 2) შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს და დაბეჭდეთ, შემდეგ შექმენით ცვლადი სადაც შეინახავთ თქვენს ასაკს და დაბეჭდეთ, შემდეგ შექმენით num1 ცვლადი, შემდეგ ხაზზე განაახლეთ ცვლადის მნიშვნელობა და დაპრინტეთ ეს ცვლადიც
name = 'Luka'
print(name)
me_age = 11
print(me_age)

num1 = 14
num1 = 11
print(num1)


# 3) შექმენით ცვლადი "sport" რომელშიც შეინახავთ თავიდან ფეხბურთს, შემდეგ ხაზზე შუცვალეთ მნიშვნელობა და გახდეს კალათბურთი, შემდეგ ხაზზე კიდევ ერთხელ შეუცვალეთ მნიშვნელობა და გახდეს ნებისმიერი თქვენთვის სასურველი სპორტი. შემდეგ დაპრინტეთ "sport" ცვლადი
sport = 'football'
sprot = 'Basketball'
sport = 'ping ponk'
print(sport)