# სიაში 5 ელემენტის შექმნა
news_list = ["სიახლე 1", "სიახლე 2", "სიახლე 3", "სიახლე 4", "სიახლე 5"]

# ინდექსების გამოყენებით თითოეული ელემენტის ბეჭდვა
print(news_list[0])
print(news_list[1])
print(news_list[2])
print(news_list[3])
print(news_list[4])


# სიის შექმნა 3 რიცხვით
numbers = [5, 15, 25]

# მენულე (პირველი) ინდექსზე მყოფი რიცხვის შეცვლა (10-ის დამატება)
numbers[0] += 10  # numbers[0] = numbers[0] + 10

# პირველი (მენულე) და მესამე (მეორე) რიცხვების ჯამის გამოთვლა და დაბეჭდვა
result = numbers[0] + numbers[2]
print("პირველი და მესამე რიცხვების ჯამი:", result)


# მომხმარებლის მიერ შეყვანილი რიცხვის მიღება და მთელი რიცხვად გარდაქმნა
index = int(input("შეიყვანეთ ინდექსი (0-დან 9-მდე): "))

# 10-ელემენტიანი სიის შექმნა
numbers = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

# ინდექსის მიხედვით შესაბამისი ელემენტის დაბეჭდვა
if 0 <= index < len(numbers):  # ვამოწმებთ, რომ ინდექსი სწორ დიაპაზონშია
    print("სიის ამ ინდექსზე არსებული ელემენტი არის:", numbers[index])
else:
    print("შეყვანილი ინდექსი არასწორია! უნდა იყოს 0-დან 9-მდე.")

