
# დიაპაზონი 10-მდე
range_10 = list(range(10))  # 0-9

# დიაპაზონი 15-ის ჩათვლით
range_15 = list(range(16))  # 0-15

# დიაპაზონი 20-მდე
range_20 = list(range(20))  # 0-19

# დიაპაზონი 2-დან 10-ის ჩათვლით
range_2_to_10 = list(range(2, 11))  # 2-10

# დიაპაზონი 4-დან 7-მდე
range_4_to_7 = list(range(4, 7))  # 4-6

# დიაპაზონი 3-დან 15-ის ჩათვლით
range_3_to_15 = list(range(3, 16))  # 3-15

# დიაპაზონი 2-დან 8-მდე, ინკრემენტაცია 2-ით
range_2_to_8_step2 = list(range(2, 9, 2))  # 2, 4, 6, 8

# დიაპაზონი 10-დან 40-ის ჩათვლით, ინკრემენტაცია 5-ით
range_10_to_40_step5 = list(range(10, 41, 5))  # 10, 15, 20, 25, 30, 35, 40

# დიაპაზონი 3-დან 15-ის ჩათვლით, ინკრემენტაცია 3-ით
range_3_to_15_step3 = list(range(3, 16, 3))  # 3, 6, 9, 12, 15
